# Core taps
tap "algertc/kleopatra4mac"
tap "anomalyco/tap"
tap "fabricsoul/gitfetch", "https://github.com/FabricSoul/gitfetch"
tap "gcenx/wine"
tap "jesseduffield/lazydocker"
tap "kegworks-app/kegworks"
tap "koekeishiya/formulae"
tap "linux-noah/noah"
tap "robotsandpencils/made"
tap "tw93/tap"
tap "xcodesorg/made"

# Cross-platform packages (work on both macOS and Linux)
brew "openssl@3"
brew "ansible"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "glib"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bat"
brew "bison"
brew "protobuf"
brew "bloaty"
brew "btop"
brew "freetype"
brew "oven-sh/bun/bun"
brew "cargo-binstall"
brew "ccache"
brew "icu4c@77"
brew "harfbuzz"
brew "pango"
brew "chafa"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "docker"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "flex"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@7"
brew "fish"
brew "fisher"
brew "fzf"
brew "gallery-dl"
brew "gcc"
brew "gcc@12"
brew "ggshield"
brew "gh"
brew "ghidra"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "gnu-sed"
brew "libassuan"
brew "gnupg"
brew "go"
brew "gperf"
brew "gpgme"
brew "grep"
brew "hashcat"
brew "htop"
brew "icu4c@76"
brew "libtool"
brew "imagemagick"
brew "jj"
brew "jjui"
brew "jq"
brew "lazygit"
brew "libiconv"
brew "libmagic"
brew "libmediainfo"
brew "llvm"
brew "lld"
brew "python@3.12"
brew "llvm@16"
brew "llvm@19"
brew "lowdown"
brew "macchina"
brew "make"
brew "media-info"
brew "mingw-w64"
brew "minicom"
brew "molten-vk"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "ninja"
brew "nmap"
brew "node"
brew "numpy"
brew "onefetch"
brew "openvino"
brew "pandoc"
brew "pfetch"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "poppler"
brew "portmidi"
brew "putty"
brew "pyenv"
brew "pypy"
brew "pypy3.10"
brew "pypy3.9", link: false
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "qt"
brew "qt@5"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rustup"
brew "cargo-binstall"
brew "scc"
brew "sevenzip"
brew "scons"
brew "sherlock"
brew "starship"
brew "stow"
brew "swiftlint"
brew "tailscale"
brew "telnet"
brew "tree"
brew "unar"
brew "uv"
brew "wget"
brew "winetricks"
brew "yazi", args: ["HEAD"]
brew "yt-dlp"
brew "zellij"
brew "zigup"
brew "zoxide"
brew "anomalyco/tap/opencode"
brew "fabricsoul/gitfetch/gitfetch"
brew "jesseduffield/lazydocker/lazydocker"
brew "tw93/tap/mole"

# macOS-specific
brew "arm-none-eabi-gcc" if OS.mac?
brew "blueutil" if OS.mac?
brew "pinentry-mac" if OS.mac?
brew "swift-format" if OS.mac?
brew "swiftformat" if OS.mac?
brew "swiftlint" if OS.mac?
brew "xcbeautify" if OS.mac?
brew "xcode-build-server" if OS.mac?
brew "xcodegen" if OS.mac?
brew "xcodes" if OS.mac?
brew "koekeishiya/formulae/skhd" if OS.mac?
brew "koekeishiya/formulae/yabai" if OS.mac?
cask "alt-tab" if OS.mac?
cask "basictex" if OS.mac?
cask "chromium" if OS.mac?
cask "dotnet-sdk@8" if OS.mac?
cask "ghidra" if OS.mac?
cask "gstreamer-runtime" if OS.mac?
cask "kegworks-app/kegworks/kegworks" if OS.mac?
cask "linearmouse" if OS.mac?
cask "macfuse" if OS.mac?
cask "obs" if OS.mac?
cask "temurin" if OS.mac?
cask "vesktop" if OS.mac?
cask "wine-stable" if OS.mac?
cask "xquartz" if OS.mac?

# Linux-specific
brew "xclip" if OS.linux?
cask "zen" if OS.linux?

# VSCode extensions (cross-platform)
vscode "adrianwilczynski.format-selection-as-html"
vscode "amiralizadeh9480.cpp-helper"
vscode "artlaman.chalice-icon-theme"
vscode "asvetliakov.vscode-neovim"
vscode "augustocdias.tasks-shell-input"
vscode "austenc.tailwind-docs"
vscode "be5invis.vscode-custom-css"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bentodaniel.vs-tab-groups"
vscode "better-ts-errors.better-ts-errors"
vscode "bierner.comment-tagged-templates"
vscode "bierner.emojisense"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "bwork.zig-tools"
vscode "codezombiech.gitignore"
vscode "craigb85.custom-window-zoom"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dpdpdp.habamix"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-hide-comments"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "ethansk.restore-terminals"
vscode "figma.figma-vscode-extension"
vscode "funkyremi.vscode-google-translate"
vscode "gitguardian-secret-security.gitguardian"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gregorbiswanger.json2ts"
vscode "gulajavaministudio.mayukaithemevsc"
vscode "hankchizljaw.soot-theme"
vscode "icsharpcode.ilspy-vscode"
vscode "jackytsu.text-transformer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "juwanpetty.github-icons-for-vscode"
vscode "kamikillerto.vscode-colorize"
vscode "kuscamara.remove-unused-imports"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lorenzopirro.zig-snippets"
vscode "maciejdems.add-to-gitignore"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "marus25.cortex-debug"
vscode "mathematic.vscode-latex"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mde.select-highlight-minimap"
vscode "mechatroner.rainbow-csv"
vscode "mhcpnl.xcodestrings"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "miguelsolorio.symbols"
vscode "mishkinf.goto-next-previous-member"
vscode "mohd-akram.vscode-html-format"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mylesmurphy.prettify-ts"
vscode "naumovs.color-highlight"
vscode "netcorext.uuid-generator"
vscode "oouo-diogo-perdigao.docthis"
vscode "oscartbeaumont.rspc-vscode"
vscode "oven.bun-vscode"
vscode "ow.vscode-subword-navigation"
vscode "pepri.subtitles-editor"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "pucelle.vscode-css-navigation"
vscode "rcore.rcore-unused-css-classes"
vscode "rechinformatica.rech-editor-batch"
vscode "richie5um2.vscode-sort-json"
vscode "rioj7.command-variable"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "sanaajani.taskrunnercode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "silvenon.mdx"
vscode "simonsiefke.svg-preview"
vscode "spmeesseman.vscode-taskexplorer"
vscode "sswg.swift-lang"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "teabyii.ayu"
vscode "tek256.simple-dark"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "tlevesque2.duplicate-finder"
vscode "tonka3000.qtvsctools"
vscode "twxs.cmake"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usama8800.tab-groups"
vscode "vadimcn.vscode-lldb"
vscode "vendicated.vencord-companion"
vscode "vknabel.vscode-apple-swift-format"
vscode "vknabel.vscode-swiftformat"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "webfreak.debug"
vscode "webhooked.kanso-theme"
vscode "wiensss.region-highlighter"
vscode "wk-j.save-and-run"
vscode "xadillax.viml"
vscode "xaver.clang-format"
vscode "xyc.vscode-mdx-preview"
vscode "yinfei.luahelper"
vscode "zhouronghui.propertylist"
vscode "ziglang.vscode-zig"
vscode "zxh404.vscode-proto3"
